In [1]:
import pandas as pd
import numpy as np

In [60]:
df=pd.read_excel('Production data.xlsx')

In [61]:
df

    Unnamed: 0 Unnamed: 1 Unnamed: 2
0          NaN       Time          Y
1          NaN       1950       3309
2          NaN       1951       4715
3          NaN       1952       5316
4          NaN       1953       3771
..         ...        ...        ...
71         NaN       2020       9354
72         NaN       2021      10149
73         NaN       2022       9392
74         NaN       2023      10500
75         NaN       2024       9191

[76 rows x 3 columns]

In [4]:
df.drop(columns='Unnamed: 0',inplace=True)

In [5]:
df

   Unnamed: 1 Unnamed: 2
0        Time          Y
1        1950       3309
2        1951       4715
3        1952       5316
4        1953       3771
..        ...        ...
71       2020       9354
72       2021      10149
73       2022       9392
74       2023      10500
75       2024       9191

[76 rows x 2 columns]

In [6]:
df.columns=df.iloc[0]  # changing the column heading according to the data

In [7]:
df=df[1:]

In [8]:
df

0   Time      Y
1   1950   3309
2   1951   4715
3   1952   5316
4   1953   3771
5   1954   3860
..   ...    ...
71  2020   9354
72  2021  10149
73  2022   9392
74  2023  10500
75  2024   9191

[75 rows x 2 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 1 to 75
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Time    75 non-null     object
 1   Y       75 non-null     object
dtypes: object(2)
memory usage: 1.3+ KB

In [10]:
df.describe()

0       Time     Y
count     75    75
unique    75    75
top     1950  3309
freq       1     1

In [11]:
df.isnull().sum()   #there is no null value inside the data

0
Time    0
Y       0
dtype: int64

In [12]:
df['Time']=df['Time'].astype(int)
df['Y']=df['Y'].astype(int)              #converting the object data type into the integer

C:\Users\admin-1\AppData\Local\Temp\ipykernel_5960\4283586620.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Time']=df['Time'].astype(int)
C:\Users\admin-1\AppData\Local\Temp\ipykernel_5960\4283586620.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Y']=df['Y'].astype(int)              #converting the object data type into the integer

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 1 to 75
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Time    75 non-null     int32
 1   Y       75 non-null     int32
dtypes: int32(2)
memory usage: 732.0 bytes

In [14]:
x=df['Time']
y=df["Y"]

In [15]:
x

1     1950
2     1951
3     1952
4     1953
5     1954
      ...
71    2020
72    2021
73    2022
74    2023
75    2024
Name: Time, Length: 75, dtype: int32

In [16]:
x_reshaped = x.values.reshape(-1, 1)

In [17]:
y

1      3309
2      4715
3      5316
4      3771
5      3860
      ...
71     9354
72    10149
73     9392
74    10500
75     9191
Name: Y, Length: 75, dtype: int32

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
x_train,x_test,y_train,y_test=train_test_split(x_reshaped,y,random_state=42,test_size=0.25)

In [20]:
x_train.shape

(56, 1)

In [21]:
x_test.shape

(19, 1)

In [22]:
from sklearn.svm import SVC    #support vector machine model

In [23]:
svc=SVC()

In [24]:
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score

In [25]:
svc.fit(x_train,y_train)
y_pred=svc.predict(x_test)
mae=mean_absolute_error(y_test,y_pred)
score=r2_score(y_test,y_pred)
print("mean absolute error"  ,mae)
print("r2_score" ,score*100)

mean absolute error 1103.0526315789473
r2_score 69.27962310128125

In [26]:
y_pred

array([ 3771, 10930,  8236,  4715,  8626, 10930,  7961,  8236,  9820,
       10524,  8626, 10286, 10556,  7592,  6911,  7677,  5805,  7171,
       11211])

In [42]:
df1=pd.read_excel("data shivu2.xlsx")

In [43]:
df1.head()

   Year  area  production  productivity
0  1950   571        3309          1043
1  1951   790        4715          1074
2  1952   734        4629          1135
3  1953   497        3116          1129
4  1954   503        2952          1056

In [44]:
df1.drop(columns='productivity',inplace=True)

In [45]:
df1.head()

   Year  area  production
0  1950   571        3309
1  1951   790        4715
2  1952   734        4629
3  1953   497        3116
4  1954   503        2952

In [47]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        74 non-null     int64
 1   area        74 non-null     int64
 2   production  74 non-null     int64
dtypes: int64(3)
memory usage: 1.9 KB

In [48]:
x=df1.drop(columns="production")
y=df1["production"]

In [51]:
x.shape

(74, 2)

In [52]:
y.shape

(74,)

In [53]:
from sklearn.model_selection import train_test_split

In [54]:
x_train,x_test,y_train,y_test=train_test_split(x,y,random_state=42,test_size=0.25)

In [55]:
from sklearn.svm import SVC

In [56]:
svc=SVC()

In [57]:
from sklearn.metrics import mean_squared_error,mean_absolute_error,r2_score

In [58]:
svc.fit(x_train,y_train)
y_pred=svc.predict(x_test)
mae=mean_absolute_error(y_test,y_pred)
score=r2_score(y_test,y_pred)
print("mean absolute error"  ,mae)
print("r2_score" ,score*100)

mean absolute error 464.5263157894737
r2_score 95.71847810736004

In [59]:
y_pred

array([ 3116, 10618,  3116,  4440,  6320,  8989,  4471,  6072,  6064,
       10618, 10618,  6072,  4015,  7997,  4015,  5800, 11771,  9428,
        5655], dtype=int64)

In [63]:
from sklearn.linear_model import LinearRegression

In [64]:
linreg=LinearRegression()

In [65]:
linreg.fit(x_train,y_train)
y_pred=linreg.predict(x_test)
mae=mean_absolute_error(y_test,y_pred)
score=r2_score(y_test,y_pred)
print("mean absolute error"  ,mae)
print("r2_score" ,score*100)

mean absolute error 699.2287419074427
r2_score 90.8745901872219